In [1]:
%load_ext sql

In [2]:
%sql postgresql://student:student@127.0.0.1/sparkifydb

'Connected: student@sparkifydb'

# the 10 most popular songs

In [11]:

%%sql 

select title, count(session_id) as plays from 
        songplays inner join songs
        on songplays.song_id = songs.song_id
        group by songs.title
        order by plays desc 
        limit 10

 * postgresql://student:***@127.0.0.1/sparkifydb
1 rows affected.

[('Setanta matins', 1)]

# the 10 most popular artists

In [12]:

%%sql 

select name, count(session_id) as plays from 
        songplays inner join artists
        on songplays.artist_id = artists.artist_id
        group by artists.artist_id
        order by plays desc 
        limit 10

 * postgresql://student:***@127.0.0.1/sparkifydb
1 rows affected.

[('Elena', 1)]

# the 10 most popular user agent

In [13]:

%%sql 

select user_agent, count(user_agent) as counts from 
        songplays 
        group by user_agent
        order by counts desc 
        limit 10

 * postgresql://student:***@127.0.0.1/sparkifydb
10 rows affected.

[('"Mozilla/5.0 (Macintosh; Intel Mac OS X 10_9_4) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/36.0.1985.143 Safari/537.36"', 971),
 ('"Mozilla/5.0 (Macintosh; Intel Mac OS X 10_9_4) AppleWebKit/537.78.2 (KHTML, like Gecko) Version/7.0.6 Safari/537.78.2"', 708),
 ('Mozilla/5.0 (Windows NT 5.1; rv:31.0) Gecko/20100101 Firefox/31.0', 696),
 ('"Mozilla/5.0 (X11; Linux x86_64) AppleWebKit/537.36 (KHTML, like Gecko) Ubuntu Chromium/36.0.1985.125 Chrome/36.0.1985.125 Safari/537.36"', 577),
 ('"Mozilla/5.0 (X11; Linux x86_64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/37.0.2062.94 Safari/537.36"', 573),
 ('Mozilla/5.0 (Macintosh; Intel Mac OS X 10.9; rv:31.0) Gecko/20100101 Firefox/31.0', 443),
 ('"Mozilla/5.0 (Windows NT 6.3; WOW64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/36.0.1985.143 Safari/537.36"', 427),
 ('"Mozilla/5.0 (Windows NT 6.1; WOW64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/36.0.1985.125 Safari/537.36"', 419),
 ('"Mozilla/5.0 (Macintosh; Intel Mac OS X 10_9_4) AppleWebKit/537.77.4 (KHTML, like Gecko) Version/7.0.5 Safari/537.77.4"', 319),
 ('Mozilla/5.0 (Windows NT 6.1; WOW64; rv:31.0) Gecko/20100101 Firefox/31.0', 310)]

# the 10 most popular location where sparkify users live

In [10]:

%%sql

select location, count(location) as counts from 
        songplays 
        group by location
        order by counts desc 
        limit 10

 * postgresql://student:***@127.0.0.1/sparkifydb
10 rows affected.

[('San Francisco-Oakland-Hayward, CA', 691),
 ('Portland-South Portland, ME', 665),
 ('Lansing-East Lansing, MI', 557),
 ('Chicago-Naperville-Elgin, IL-IN-WI', 475),
 ('Atlanta-Sandy Springs-Roswell, GA', 456),
 ('Waterloo-Cedar Falls, IA', 397),
 ('Lake Havasu City-Kingman, AZ', 321),
 ('Tampa-St. Petersburg-Clearwater, FL', 307),
 ('San Jose-Sunnyvale-Santa Clara, CA', 292),
 ('Sacramento--Roseville--Arden-Arcade, CA', 270)]

# the 10 most active users

In [16]:
%%sql

select users.first_name, users.last_name, count(songplays.user_id) as counts from 
        songplays inner join users on users.user_id = songplays.user_id
        group by songplays.user_id, users.first_name, users.last_name
        order by counts desc 
        limit 10

 * postgresql://student:***@127.0.0.1/sparkifydb
10 rows affected.

[('Chloe', 'Cuevas', 1037),
 ('Tegan', 'Levine', 665),
 ('Kate', 'Harrell', 557),
 ('Lily', 'Koch', 463),
 ('Rylan', 'George', 409),
 ('Aleena', 'Kirby', 397),
 ('Layla', 'Griffin', 381),
 ('Jacob', 'Klein', 346),
 ('Jacqueline', 'Lynch', 346),
 ('Matthew', 'Jones', 338)]